---
kind: method
id: M:Autodesk.Revit.DB.FilteredWorksetCollector.GetBasicIEnumerator
source: html/7cda3b6a-f513-3c90-39cd-8c7b4ffd0060.htm
---
# Autodesk.Revit.DB.FilteredWorksetCollector.GetBasicIEnumerator Method

Returns an enumerator that iterates through a collection.

## Syntax (C#)
```csharp
internal virtual IEnumerator GetBasicIEnumerator()
```

## Returns
An IEnumerator object that can be used to iterate through the collection.